////? Alert (Попередження):
////? Використовується для відображення повідомлення користувачу з кнопкою "OK". Наприклад:
////? window.alert("Це попередження!");
////? Prompt (Запит):
////? Використовується для отримання введеного користувачем значення. Він також має кнопки "OK" і "Cancel". Наприклад:
////? let result = window.prompt("Будь ласка, введіть своє ім'я", "Гість");
////? Confirm (Підтвердження):
////? Використовується для підтвердження або скасування дії користувачем. Має кнопки "OK" і "Cancel". Наприклад:
////? let result = window.confirm("Ви впевнені, що хочете видалити цей елемент?");

//let result = prompt("Введіть ваше ім'я")
//let trueInfo = confirm('Привіт ' + result+" Сьогодні сонячний день?")
//if(trueInfo){
//    alert('Щасливої прогулянки')
//}else{
//    alert('Не забудь вдягнути куртку')
//}


//?Цикл for використовується тоді, коли відомо точну кількість ітерацій, які потрібно виконати. Він має три частини:

//*Ініціалізація
//*Умова
//*Інкремент (або декремент)
//for (ініціалізація; умова; інкремент/декремент) {
// код, який виконується на кожній ітерації
//  }
let result = 0
let user = prompt("Введіть ваше ім'я")
let test = confirm("Готовий пройти тест?")
let qwestions = [
    {qwestion:"Назвіть столицю Франції?",input:"Париж"},
    {qwestion:"Назвіть столицю Франції?",input:"Париж"},
    {qwestion:"Назвіть столицю Франції?",input:"Париж"},
]
if(test){
    for (let i = 0; i < qwestions.length; i++) {
        let qwestion = prompt(qwestions[i].qwestion)
        if(qwestion==qwestions[i].input) result+=1
    }
    alert(user+' твій результат '+result)
    
}
